
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 17 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_management_lock.storage-backup-final
  * azurerm_management_lock.storage-backup-ingest
  * azurerm_management_lock.storage-backup-sa
  * azurerm_resource_group.rg_backup
  * azurerm_role_assignment.powerapp_appreg_finalbackup
  * azurerm_role_assignment.powerapp_appreg_ingestfinal
  * azurerm_role_assignment.powerapp_appreg_sa2
  * azurerm_role_assignment.powerapp_appreg_sabackup
  * module.ams_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.finalsa_storage_account_backup.azapi_update_resource.defender_settings
  * module.finalsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account_backup.azapi_update_resource.defender_settings
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy
  * module.sa_storage_account_backup.azapi_update_resource.defender_settings
  * module.sa_storage_account_backup.azurerm_storage_account.storage_account
* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * module.ams_api[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_management_lock.storage-backup-final will be created
  + resource "azurerm_management_lock" "storage-backup-final" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "storage-backup"
      + notes      = "prevent users from deleting storage accounts"
      + scope      = (known after apply)
    }

  # azurerm_management_lock.storage-backup-ingest will be created
  + resource "azurerm_management_lock" "storage-backup-ingest" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "storage-backup"
      + notes      = "prevent users from deleting storage accounts"
      + scope      = (known after apply)
    }

  # azurerm_management_lock.storage-backup-sa will be created
  + resource "azurerm_management_lock" "storage-backup-sa" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "storage-backup"
      + notes      = "prevent users from deleting storage accounts"
      + scope      = (known after apply)
    }

  # azurerm_resource_group.rg_backup will be created
  + resource "azurerm_resource_group" "rg_backup" {
      + id       = (known after apply)
      + location = "ukwest"
      + name     = "pre-stg-backup"
      + tags     = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # azurerm_role_assignment.powerapp_appreg_finalbackup will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_finalbackup" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.powerapp_appreg_ingestfinal will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_ingestfinal" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.powerapp_appreg_sa2 will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_sa2" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.powerapp_appreg_sabackup will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_sabackup" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ams_api[0].azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "pre-api"
      ~ revision              = "6" -> "7" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      ~ subscription_required = false -> true
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (7 unchanged attributes hidden)

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.ams_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pre-api"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account_backup.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.finalsa_storage_account_backup.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "ukwest"
      + min_tls_version                   = "TLS1_2"
      + name                              = "prefinalsabackupstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg-backup"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + immutability_policy {
          + allow_protected_append_writes = true
          + period_since_creation_in_days = 1
          + state                         = "Unlocked"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ]
        }
    }

  # module.ingestsa_storage_account_backup.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "ukwest"
      + min_tls_version                   = "TLS1_2"
      + name                              = "preingestsabackupstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg-backup"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + immutability_policy {
          + allow_protected_append_writes = true
          + period_since_creation_in_days = 1
          + state                         = "Unlocked"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ]
        }
    }

  # module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="https://pre-api.staging.platform.hmcts.net" />
                    <cors allow-credentials="false">
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.sa_storage_account_backup.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa_storage_account_backup.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "ukwest"
      + min_tls_version                   = "TLS1_2"
      + name                              = "presabackupstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg-backup"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ]
        }
    }

Plan: 17 to add, 2 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.rg_backup has been deleted
  - resource "azurerm_resource_group" "rg_backup" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup"
      - name     = "pre-stg-backup" -> null
        tags     = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (1 unchanged attribute hidden)
    }

  # module.finalsa_storage_account_backup.azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/prefinalsabackupstg" -> null
        name                              = "prefinalsabackupstg"
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://prefinalsabackupstg.blob.core.windows.net/" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://prefinalsabackupstg.dfs.core.windows.net/" -> null
      - primary_file_endpoint             = "https://prefinalsabackupstg.file.core.windows.net/" -> null
      - primary_location                  = "ukwest" -> null
      - primary_queue_endpoint            = "https://prefinalsabackupstg.queue.core.windows.net/" -> null
      - primary_table_endpoint            = "https://prefinalsabackupstg.table.core.windows.net/" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (26 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupstg" -> null
        name                              = "preingestsabackupstg"
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://preingestsabackupstg.blob.core.windows.net/" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://preingestsabackupstg.dfs.core.windows.net/" -> null
      - primary_file_endpoint             = "https://preingestsabackupstg.file.core.windows.net/" -> null
      - primary_location                  = "ukwest" -> null
      - primary_queue_endpoint            = "https://preingestsabackupstg.queue.core.windows.net/" -> null
      - primary_table_endpoint            = "https://preingestsabackupstg.table.core.windows.net/" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (26 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sa_storage_account_backup.azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/presabackupstg" -> null
        name                              = "presabackupstg"
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://presabackupstg.blob.core.windows.net/" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://presabackupstg.dfs.core.windows.net/" -> null
      - primary_file_endpoint             = "https://presabackupstg.file.core.windows.net/" -> null
      - primary_location                  = "ukwest" -> null
      - primary_queue_endpoint            = "https://presabackupstg.queue.core.windows.net/" -> null
      - primary_table_endpoint            = "https://presabackupstg.table.core.windows.net/" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":680,"Program":"tfcmt","SHA1":"","Vars":{}} -->